BEGIN;

-- 1

SELECT "НАИМЕНОВАНИЕ", "ЧЛВК_ИД"
FROM "Н_ВЕДОМОСТИ"
         INNER JOIN "Н_ТИПЫ_ВЕДОМОСТЕЙ" ON "ТВ_ИД" = "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД"
WHERE "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" > 'Ведомость'
  AND "Н_ВЕДОМОСТИ"."ИД" > 1250981;

-- 2

SELECT "Н_ЛЮДИ"."ИД", "Н_ОБУЧЕНИЯ"."НЗК", "Н_УЧЕНИКИ"."НАЧАЛО"
FROM "Н_ЛЮДИ"
         INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         INNER JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" > 'Владимирович'
  AND "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" > 163276
  AND "Н_УЧЕНИКИ"."ГРУППА" < '4103';

-- 3

SELECT COUNT(*)
FROM (SELECT "ОТЧЕСТВО"
      FROM "Н_ЛЮДИ"
      GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО") AS НЛО;

-- 4

SELECT "ИД"
FROM (SELECT "Н_ПЛАНЫ"."ИД", "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ"
      FROM "Н_ГРУППЫ_ПЛАНОВ"
               INNER JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
               INNER JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
      WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ') AS GROUPS
GROUP BY "ИД"
HAVING COUNT(*) > 2;

-- 5

WITH MIN_AGE AS (SELECT MIN(DATE_PART('year', AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
                 FROM "Н_УЧЕНИКИ"
                          INNER JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                 WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1101')
SELECT IGA."ГРУППА", AVG(IGA."ВОЗРАСТ") AS "СРЕДНИЙ_ВОЗРАСТ"
FROM (SELECT "Н_УЧЕНИКИ"."ГРУППА", DATE_PART('year', AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) AS "ВОЗРАСТ"
      FROM "Н_УЧЕНИКИ"
               INNER JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД") AS IGA
GROUP BY IGA."ГРУППА"
HAVING AVG(IGA."ВОЗРАСТ") > (SELECT * FROM MIN_AGE);

-- 6

SELECT "Н_УЧЕНИКИ"."ГРУППА",
       "Н_УЧЕНИКИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_УЧЕНИКИ"."П_ПРКОК_ИД"
FROM "Н_УЧЕНИКИ"
         INNER JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         INNER JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
         INNER JOIN "Н_НАПР_СПЕЦ" ON "Н_НАПР_СПЕЦ"."ИД" = "Н_ПЛАНЫ"."НАПС_ИД"
WHERE "Н_ПЛАНЫ"."КУРС" = 1
  AND "Н_НАПР_СПЕЦ"."КОД_НАПРСПЕЦ" = '230101'
  AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
  AND "Н_УЧЕНИКИ"."НАЧАЛО" = TIMESTAMP '2012-09-01';

-- 7

SELECT s1."ИД", s1."ИМЯ"
FROM "Н_ЛЮДИ" AS s1,
     "Н_ЛЮДИ" AS s2
WHERE s1."ИМЯ" = s2."ИМЯ"
  AND s1."ИД" <> s2."ИД"
  AND s1."ДАТА_РОЖДЕНИЯ" <> s2."ДАТА_РОЖДЕНИЯ"
GROUP BY s1."ИД", s2."ИД", s1."ИМЯ", s2."ИМЯ";

COMMIT;
